In [1]:
simple_list=[1,'data',20.525,4525,4454,1,2,3,4,5,6,7,8,9,525,415,7465]

print(simple_list)

[1, 'data', 20.525, 4525, 4454, 1, 2, 3, 4, 5, 6, 7, 8, 9, 525, 415, 7465]

In [2]:
simple_list[1]

'data'

In [3]:
counter=0
for i in simple_list:
    print(i)
    counter = counter + 1
print(counter)

1
data
20.525
4525
4454
1
2
3
4
5
6
7
8
9
525
415
7465
17

In [4]:
simple_list[1]=46
print(simple_list)
for i in simple_list[0:5]:
    for j in simple_list[5:9]:
        print(i*j)
    print('outof j loop')
print('outside of both look')

[1, 46, 20.525, 4525, 4454, 1, 2, 3, 4, 5, 6, 7, 8, 9, 525, 415, 7465]
1
2
3
4
outof j loop
46
92
138
184
outof j loop
20.525
41.05
61.574999999999996
82.1
outof j loop
4525
9050
13575
18100
outof j loop
4454
8908
13362
17816
outof j loop
outside of both look

In [5]:
print(range(6))

range(0, 6)

In [6]:
for i in range(6):
    print(i)

0
1
2
3
4
5

In [7]:
print(range(1,6))

range(1, 6)

In [8]:
for i in range(1,6):
    print(i)

1
2
3
4
5

In [9]:
for i in range(2,10,3):
    print(i)

2
5
8

In [10]:
list(range(1,100,2))

[1,
 3,
 5,
 7,
 9,
 11,
 13,
 15,
 17,
 19,
 21,
 23,
 25,
 27,
 29,
 31,
 33,
 35,
 37,
 39,
 41,
 43,
 45,
 47,
 49,
 51,
 53,
 55,
 57,
 59,
 61,
 63,
 65,
 67,
 69,
 71,
 73,
 75,
 77,
 79,
 81,
 83,
 85,
 87,
 89,
 91,
 93,
 95,
 97,
 99]

In [11]:
# while loop

i=4
while i< 100:
    print(i) 
    i = i+1
print('outside of loop')

4
5
6
7
8
9
10
11
12
13
14
15
16
17
18
19
20
21
22
23
24
25
26
27
28
29
30
31
32
33
34
35
36
37
38
39
40
41
42
43
44
45
46
47
48
49
50
51
52
53
54
55
56
57
58
59
60
61
62
63
64
65
66
67
68
69
70
71
72
73
74
75
76
77
78
79
80
81
82
83
84
85
86
87
88
89
90
91
92
93
94
95
96
97
98
99
outside of loop

In [14]:
i=4
while i< 100:
    print(i) 
    i = i+1

4
5
6
7
8
9
10
11
12
13
14
15
16
17
18
19
20
21
22
23
24
25
26
27
28
29
30
31
32
33
34
35
36
37
38
39
40
41
42
43
44
45
46
47
48
49
50
51
52
53
54
55
56
57
58
59
60
61
62
63
64
65
66
67
68
69
70
71
72
73
74
75
76
77
78
79
80
81
82
83
84
85
86
87
88
89
90
91
92
93
94
95
96
97
98
99

In [15]:
list = [1,2,3,4]
for i in list:
    print(i*2)

2
4
6
8

In [16]:
# condtioonal statment 

i = 20
if i<10:
    print('less than')
else:
    print('greater than')

greater than

In [17]:
a=1
for i in range(1,6):
    a=a*i
    print(a)

1
2
6
24
120

In [19]:
i='20'
if i>20:
    print('1')
else:
    print('2')

TypeError: '>' not supported between instances of 'str' and 'int'

In [20]:
x=5
y=7
z=9

(x**y)+(y/z)+(x-y)+(z-y)-(y*x)

78090.77777777778

In [21]:
print('\')

SyntaxError: EOL while scanning string literal (<ipython-input-21-eaac87876c3b>, line 1)

In [22]:
list = ['a','b','c','d']
list[2]

'c'

In [23]:
for i in range(2,10,2):
     print(i)

2
4
6
8

In [24]:
i = 1
while i < 6:
  if i%2==0:
    print(i)
  i += 1

2
4

In [25]:
c= {
"fruit": "Apple",
"vegetable": "Tomato",
"flower": "Rose"
}

type(c)

dict

In [26]:
# Numpay

import numpy as np

In [27]:
print(np.cos(np.pi))

-1.0

In [28]:
print(np.square(range(6)))

[ 0  1  4  9 16 25]

In [29]:
print(np.log(np.exp(5.2)))

5.2

In [30]:
vec = np.array([1,2,3])
mat = np.array([[1,2,3],[4,5,6],[7,8,9]])
print(vec)
print('')
print(mat)

print('')

print(mat.T)

[1 2 3]

[[1 2 3]
 [4 5 6]
 [7 8 9]]

[[1 4 7]
 [2 5 8]
 [3 6 9]]

In [31]:
vec2 = np.arange(0,15)
print(vec2)
vec3 = np.arange(3,21,6)
print(vec3)

[ 0  1  2  3  4  5  6  7  8  9 10 11 12 13 14]
[ 3  9 15]

In [32]:
vec4 = np.linspace(0,5,10)
print(vec4)

[0.         0.55555556 1.11111111 1.66666667 2.22222222 2.77777778
 3.33333333 3.88888889 4.44444444 5.        ]

In [33]:
print(vec4.reshape(2,5))

[[0.         0.55555556 1.11111111 1.66666667 2.22222222]
 [2.77777778 3.33333333 3.88888889 4.44444444 5.        ]]

In [34]:
vecc = np.linspace(10,20,3)
print(vecc)

[10. 15. 20.]

In [35]:
vecr = np.arange(0,12)
vecr1 = vecr.reshape(4,3)
print(vecr1)

[[ 0  1  2]
 [ 3  4  5]
 [ 6  7  8]
 [ 9 10 11]]

In [36]:
vec = np.array([1,'data',3.1])

In [37]:
print(vec)

['1' 'data' '3.1']

In [38]:
type(vec)

numpy.ndarray

In [39]:
list_st = vec4.tolist()

In [40]:
print(list_st)

[0.0, 0.5555555555555556, 1.1111111111111112, 1.6666666666666667, 2.2222222222222223, 2.7777777777777777, 3.3333333333333335, 3.8888888888888893, 4.444444444444445, 5.0]

In [41]:
vec=np.linspace(10,20,3)

print(vec)

[10. 15. 20.]

In [42]:
vec1=np.arange(0,12)

vec2=vec1.reshape(4,3)

print (vec2)

[[ 0  1  2]
 [ 3  4  5]
 [ 6  7  8]
 [ 9 10 11]]

In [43]:
s =[10,12,14,16,18]

np.mean(s)

14.0

In [45]:
rand_vec = np.random.rand(19)
print(rand_vec)
print(rand_vec[6])

[0.2980074  0.8983143  0.62840995 0.78007612 0.35218419 0.01449136
 0.3477245  0.35203991 0.55297519 0.73927072 0.76138139 0.92609744
 0.21771451 0.30807884 0.47805842 0.36258759 0.2073992  0.57552911
 0.25326806]
0.347724500170264

In [46]:
print(rand_vec[4:9])

[0.35218419 0.01449136 0.3477245  0.35203991 0.55297519]

In [49]:
print(np.arange(0,15,3))

[ 0  3  6  9 12]

In [50]:
# matrix

print(rand_mat)

NameError: name 'rand_mat' is not defined

In [14]:
#  Panda 

import pandas as pd
import numpy as np

In [15]:
my_list = [5.4,4.1,6.1,55.2,323.22,100.23]

In [16]:
type(my_list)

list

In [17]:
my_array = np.array(my_list)

In [18]:
myser1 = pd.Series(data = my_list)

print(myser1)

myser2 = pd.Series(data = my_array)

print(myser2)

0      5.40
1      4.10
2      6.10
3     55.20
4    323.22
5    100.23
dtype: float64
0      5.40
1      4.10
2      6.10
3     55.20
4    323.22
5    100.23
dtype: float64

In [19]:
print(myser1[2])

6.1

In [20]:
vec= np.arange(10,20)

vec2=vec[np.arange(0,10,3)]

print(vec2)

[10 13 16 19]

In [24]:
#  we can addd lables to the entries of a serices

mylables = ['first','second','third','fourth','fifth','sixth']

# myser3 = pd.Series(data = my_list , index = mylables)

myser3 = pd.Series(data = my_list , index = mylables)

print(myser3)

first       5.40
second      4.10
third       6.10
fourth     55.20
fifth     323.22
sixth     100.23
dtype: float64

In [26]:
myser5 = pd.Series([5.5,1.1,8.8,1.6],['first','third','fourth','fifth'])

print(myser5)

print('')

print(myser5 + myser3)

first     5.5
third     1.1
fourth    8.8
fifth     1.6
dtype: float64

fifth     324.82
first      10.90
fourth     64.00
second       NaN
sixth        NaN
third       7.20
dtype: float64

In [29]:
df1 = pd.concat([myser5,myser3],axis = 1, sort = False)

df1

          0       1
first   5.5    5.40
third   1.1    6.10
fourth  8.8   55.20
fifth   1.6  323.22
second  NaN    4.10
sixth   NaN  100.23

In [33]:
df2 = pd.DataFrame(np.random.rand(5,5))

df2

          0         1         2         3         4
0  0.435185  0.831956  0.411794  0.665928  0.945584
1  0.178395  0.921493  0.130963  0.471208  0.829168
2  0.800078  0.631596  0.738631  0.626104  0.337566
3  0.300751  0.549872  0.957907  0.343896  0.669918
4  0.317388  0.359998  0.465735  0.320456  0.270483

In [35]:
df3 = pd.DataFrame(np.random.rand(6,6), index=['r1','r2','r3','r4','r5','r6'], columns=['c1','c2','c3','c4','c5','c6'])

df3

          c1        c2        c3        c4        c5        c6
r1  0.988063  0.537381  0.788831  0.672549  0.483124  0.413831
r2  0.426568  0.637803  0.239687  0.444756  0.135289  0.384302
r3  0.191468  0.534977  0.413391  0.354826  0.726082  0.773683
r4  0.156808  0.374832  0.122827  0.721230  0.197899  0.379094
r5  0.775405  0.536679  0.915448  0.360215  0.339959  0.919454
r6  0.564707  0.911342  0.034604  0.457897  0.501150  0.345375

In [39]:
# data modifcation od data frame 

df3['c2']

df3[['c2','c1']]

          c2        c1
r1  0.537381  0.988063
r2  0.637803  0.426568
r3  0.534977  0.191468
r4  0.374832  0.156808
r5  0.536679  0.775405
r6  0.911342  0.564707

In [42]:
df3.loc['r4']

c1    0.156808
c2    0.374832
c3    0.122827
c4    0.721230
c5    0.197899
c6    0.379094
Name: r4, dtype: float64

In [43]:
type(df3.loc['r4'])

pandas.core.series.Series

In [44]:
df3.iloc[2]

c1    0.191468
c2    0.534977
c3    0.413391
c4    0.354826
c5    0.726082
c6    0.773683
Name: r3, dtype: float64

In [45]:
#  logical indexing 

df3>0

      c1    c2    c3    c4    c5    c6
r1  True  True  True  True  True  True
r2  True  True  True  True  True  True
r3  True  True  True  True  True  True
r4  True  True  True  True  True  True
r5  True  True  True  True  True  True
r6  True  True  True  True  True  True

In [47]:
print(df3[df3>0])

          c1        c2        c3        c4        c5        c6
r1  0.988063  0.537381  0.788831  0.672549  0.483124  0.413831
r2  0.426568  0.637803  0.239687  0.444756  0.135289  0.384302
r3  0.191468  0.534977  0.413391  0.354826  0.726082  0.773683
r4  0.156808  0.374832  0.122827  0.721230  0.197899  0.379094
r5  0.775405  0.536679  0.915448  0.360215  0.339959  0.919454
r6  0.564707  0.911342  0.034604  0.457897  0.501150  0.345375

In [53]:
# add colomns for dataframe

df3['c1'] = np.random.randn(6,1)

df3

          c1        c2        c3        c4        c5        c6        c7
r1 -2.480372  0.537381  0.788831  0.672549  0.483124  0.413831 -0.543029
r2  0.998813  0.637803  0.239687  0.444756  0.135289  0.384302  1.472353
r3 -0.739648  0.534977  0.413391  0.354826  0.726082  0.773683 -0.745648
r4  2.175179  0.374832  0.122827  0.721230  0.197899  0.379094  0.097487
r5 -1.002630  0.536679  0.915448  0.360215  0.339959  0.919454 -0.377940
r6  0.113570  0.911342  0.034604  0.457897  0.501150  0.345375  1.414293

In [55]:
df3.drop('c1',axis=1)

          c2        c3        c4        c5        c6        c7
r1  0.537381  0.788831  0.672549  0.483124  0.413831 -0.543029
r2  0.637803  0.239687  0.444756  0.135289  0.384302  1.472353
r3  0.534977  0.413391  0.354826  0.726082  0.773683 -0.745648
r4  0.374832  0.122827  0.721230  0.197899  0.379094  0.097487
r5  0.536679  0.915448  0.360215  0.339959  0.919454 -0.377940
r6  0.911342  0.034604  0.457897  0.501150  0.345375  1.414293

In [59]:
#  remove row 
df4 = df3.drop('r1',axis=0)

df4

          c1        c2        c3        c4        c5        c6        c7
r2  0.998813  0.637803  0.239687  0.444756  0.135289  0.384302  1.472353
r3 -0.739648  0.534977  0.413391  0.354826  0.726082  0.773683 -0.745648
r4  2.175179  0.374832  0.122827  0.721230  0.197899  0.379094  0.097487
r5 -1.002630  0.536679  0.915448  0.360215  0.339959  0.919454 -0.377940
r6  0.113570  0.911342  0.034604  0.457897  0.501150  0.345375  1.414293

In [60]:
df4.reset_index()

  index        c1        c2        c3        c4        c5        c6        c7
0    r2  0.998813  0.637803  0.239687  0.444756  0.135289  0.384302  1.472353
1    r3 -0.739648  0.534977  0.413391  0.354826  0.726082  0.773683 -0.745648
2    r4  2.175179  0.374832  0.122827  0.721230  0.197899  0.379094  0.097487
3    r5 -1.002630  0.536679  0.915448  0.360215  0.339959  0.919454 -0.377940
4    r6  0.113570  0.911342  0.034604  0.457897  0.501150  0.345375  1.414293

In [65]:
df4.reset_index(inplace=True)

ValueError: cannot insert level_0, already exists

In [66]:
df4.mean()

level_0    2.000000
c1         0.309057
c2         0.599126
c3         0.345191
c4         0.467785
c5         0.380076
c6         0.560381
c7         0.372109
dtype: float64

In [67]:
df7 = pd.DataFrame({"customer":['101','102','103','104'], 
                    'category': ['cat2','cat2','cat1','cat3'],
                    'important': ['yes','no','yes','yes'],
                    'sales': [123,52,214,663]},index=[0,1,2,3])

df8 = pd.DataFrame({"customer":['101','103','104','105'], 
                    'color': ['yellow','green','green','blue'],
                    'distance': [12,9,44,21],
                    'sales': [123,214,663,331]},index=[4,5,6,7])

In [68]:
pd.concat([df7,df8],axis=0,sort=False)

  customer category important  sales   color  distance
0      101     cat2       yes    123     NaN       NaN
1      102     cat2        no     52     NaN       NaN
2      103     cat1       yes    214     NaN       NaN
3      104     cat3       yes    663     NaN       NaN
4      101      NaN       NaN    123  yellow      12.0
5      103      NaN       NaN    214   green       9.0
6      104      NaN       NaN    663   green      44.0
7      105      NaN       NaN    331    blue      21.0

In [69]:
pd.concat([df7,df8],axis=0,sort=True)

  category   color customer  distance important  sales
0     cat2     NaN      101       NaN       yes    123
1     cat2     NaN      102       NaN        no     52
2     cat1     NaN      103       NaN       yes    214
3     cat3     NaN      104       NaN       yes    663
4      NaN  yellow      101      12.0       NaN    123
5      NaN   green      103       9.0       NaN    214
6      NaN   green      104      44.0       NaN    663
7      NaN    blue      105      21.0       NaN    331

In [70]:
pd.concat([df7,df8],axis=1,sort=False)

  customer category important  sales customer   color  distance  sales
0      101     cat2       yes  123.0      NaN     NaN       NaN    NaN
1      102     cat2        no   52.0      NaN     NaN       NaN    NaN
2      103     cat1       yes  214.0      NaN     NaN       NaN    NaN
3      104     cat3       yes  663.0      NaN     NaN       NaN    NaN
4      NaN      NaN       NaN    NaN      101  yellow      12.0  123.0
5      NaN      NaN       NaN    NaN      103   green       9.0  214.0
6      NaN      NaN       NaN    NaN      104   green      44.0  663.0
7      NaN      NaN       NaN    NaN      105    blue      21.0  331.0

In [71]:
pd.merge(df7,df8,how='outer',on='customer') # outer merge is union of on

  customer category important  sales_x   color  distance  sales_y
0      101     cat2       yes    123.0  yellow      12.0    123.0
1      102     cat2        no     52.0     NaN       NaN      NaN
2      103     cat1       yes    214.0   green       9.0    214.0
3      104     cat3       yes    663.0   green      44.0    663.0
4      105      NaN       NaN      NaN    blue      21.0    331.0

In [72]:
pd.merge(df7,df8,how='inner',on='customer') # inner merge is intersection of on

  customer category important  sales_x   color  distance  sales_y
0      101     cat2       yes      123  yellow        12      123
1      103     cat1       yes      214   green         9      214
2      104     cat3       yes      663   green        44      663

In [73]:
pd.merge(df7,df8,how='right',on='customer') # left merge is just first on, but all columns ... right is second

  customer category important  sales_x   color  distance  sales_y
0      101     cat2       yes    123.0  yellow        12      123
1      103     cat1       yes    214.0   green         9      214
2      104     cat3       yes    663.0   green        44      663
3      105      NaN       NaN      NaN    blue        21      331

In [74]:
df9 = pd.DataFrame({'Q1': [101,102,103],
                    'Q2': [201,202,203]},
                   index=['I0','I1','I2'])

df10 = pd.DataFrame({'Q3': [301,302,303],
                    'Q4': [401,402,403]},
                   index=['I0','I2','I3'])

In [75]:
# join behaves just like merge, 
# except instead of using the values of one of the columns 
# to combine data frames, it uses the index labels
df9.join(df10,how='right') # outer, inner, left, and right work the same as merge

       Q1     Q2   Q3   Q4
I0  101.0  201.0  301  401
I2  103.0  203.0  302  402
I3    NaN    NaN  303  403

In [76]:
# let's now go over a few more basic functialities of pandas

df8['color'].unique()

array(['yellow', 'green', 'blue'], dtype=object)

In [6]:
import pandas as pd

df = pd.read_csv('ForbesAmericasTopColleges2019.csv')

df.head()

,Rank,Name,City,State,Public/Private,Undergraduate Population,Student Population,Net Price,Average Grant Aid,Total Annual Cost,Alumni Salary,Acceptance Rate,SAT Lower,SAT Upper,ACT Lower,ACT Upper,Website
0,1,Harvard University,Cambridge,MA,Private,13844,31120,14327.0,49870.0,69600,146800.0,5.0,1460.0,1590.0,32.0,35.0,www.harvard.edu
1,2,Stanford University,Stanford,CA,Private,8402,17534,13261.0,50134.0,69109,145200.0,5.0,1390.0,1540.0,32.0,35.0,www.stanford.edu
2,3,Yale University,New Haven,CT,Private,6483,12974,18627.0,50897.0,71290,138300.0,7.0,1460.0,1580.0,32.0,35.0,www.yale.edu
3,4,Massachusetts Institute of Technology,Cambridge,MA,Private,4680,11466,20771.0,43248.0,67430,155200.0,7.0,1490.0,1570.0,33.0,35.0,web.mit.edu
4,5,Princeton University,Princeton,NJ,Private,5659,8273,9327.0,48088.0,66150,139400.0,6.0,1430.0,1570.0,31.0,35.0,www.princeton.edu

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 650 entries, 0 to 649
Data columns (total 17 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   Rank                      650 non-null    int64
 1   Name                      650 non-null    object
 2   City                      650 non-null    object
 3   State                     650 non-null    object
 4   Public/Private            650 non-null    object
 5   Undergraduate Population  650 non-null    int64
 6   Student Population        650 non-null    int64
 7   Net Price                 648 non-null    float64
 8   Average Grant Aid         646 non-null    float64
 9   Total Annual Cost         650 non-null    int64
 10  Alumni Salary             635 non-null    float64
 11  Acceptance Rate           648 non-null    float64
 12  SAT Lower                 551 non-null    float64
 13  SAT Upper                 551 non-null    float64
 14  ACT Lower                 553 non-null    float64
 15  ACT Upper                 553 non-null    float64
 16  Website                   645 non-null    object
dtypes: float64(8), int64(4), object(5)
memory usage: 86.5+ KB

In [10]:
df.shape

(650, 17)

In [11]:
df

,Rank,Name,City,State,Public/Private,Undergraduate Population,Student Population,Net Price,Average Grant Aid,Total Annual Cost,Alumni Salary,Acceptance Rate,SAT Lower,SAT Upper,ACT Lower,ACT Upper,Website
0,1,Harvard University,Cambridge,MA,Private,13844,31120,14327.0,49870.0,69600,146800.0,5.0,1460.0,1590.0,32.0,35.0,www.harvard.edu
1,2,Stanford University,Stanford,CA,Private,8402,17534,13261.0,50134.0,69109,145200.0,5.0,1390.0,1540.0,32.0,35.0,www.stanford.edu
2,3,Yale University,New Haven,CT,Private,6483,12974,18627.0,50897.0,71290,138300.0,7.0,1460.0,1580.0,32.0,35.0,www.yale.edu
3,4,Massachusetts Institute of Technology,Cambridge,MA,Private,4680,11466,20771.0,43248.0,67430,155200.0,7.0,1490.0,1570.0,33.0,35.0,web.mit.edu
4,5,Princeton University,Princeton,NJ,Private,5659,8273,9327.0,48088.0,66150,139400.0,6.0,1430.0,1570.0,31.0,35.0,www.princeton.edu
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
645,646,New Mexico State University,Las Cruces,NM,Public,13379,14432,8625.0,9582.0,34720,96700.0,64.0,910.0,1160.0,18.0,23.0,www.nmsu.edu
646,647,Indiana State University,Terre Haute,IN,Public,13626,13763,13012.0,9297.0,32938,85600.0,85.0,900.0,1110.0,17.0,23.0,www.indstate.edu
647,648,Emory &amp; Henry College,Emory,VA,Private,1094,1226,19340.0,27155.0,48100,70700.0,72.0,988.0,1170.0,19.0,25.0,www.ehc.edu
648,649,Wells College,Aurora,NY,Private,488,516,22828.0,30207.0,55180,NaN,80.0,NaN,NaN,NaN,NaN,www.wells.edu
649,650,Catawba College,Salisbury,NC,Private,1336,1463,19807.0,23662.0,44921,78100.0,42.0,930.0,1100.0,18.0,23.0,www.catawba.edu

In [13]:
df.columns

Index(['Rank', 'Name', 'City', 'State', 'Public/Private',
       'Undergraduate Population', 'Student Population', 'Net Price',
       'Average Grant Aid', 'Total Annual Cost', 'Alumni Salary',
       'Acceptance Rate', 'SAT Lower', 'SAT Upper', 'ACT Lower', 'ACT Upper',
       'Website'],
      dtype='object')

In [17]:
df.isnull().sum()

Rank                         0
Name                         0
City                         0
State                        0
Public/Private               0
Undergraduate Population     0
Student Population           0
Net Price                    2
Average Grant Aid            4
Total Annual Cost            0
Alumni Salary               15
Acceptance Rate              2
SAT Lower                   99
SAT Upper                   99
ACT Lower                   97
ACT Upper                   97
Website                      5
dtype: int64

In [24]:
df.drop(labels=['SAT Lower','SAT Upper','ACT Lower','ACT Upper','Website'],axis=1,inplace=True)
df.shape

KeyError: "['SAT Lower' 'SAT Upper' 'ACT Lower' 'ACT Upper' 'Website'] not found in axis"

In [26]:
df.index

RangeIndex(start=0, stop=650, step=1)

In [27]:
df

,Rank,Name,City,State,Public/Private,Undergraduate Population,Student Population,Net Price,Average Grant Aid,Total Annual Cost,Alumni Salary,Acceptance Rate
0,1,Harvard University,Cambridge,MA,Private,13844,31120,14327.0,49870.0,69600,146800.0,5.0
1,2,Stanford University,Stanford,CA,Private,8402,17534,13261.0,50134.0,69109,145200.0,5.0
2,3,Yale University,New Haven,CT,Private,6483,12974,18627.0,50897.0,71290,138300.0,7.0
3,4,Massachusetts Institute of Technology,Cambridge,MA,Private,4680,11466,20771.0,43248.0,67430,155200.0,7.0
4,5,Princeton University,Princeton,NJ,Private,5659,8273,9327.0,48088.0,66150,139400.0,6.0
...,...,...,...,...,...,...,...,...,...,...,...,...
645,646,New Mexico State University,Las Cruces,NM,Public,13379,14432,8625.0,9582.0,34720,96700.0,64.0
646,647,Indiana State University,Terre Haute,IN,Public,13626,13763,13012.0,9297.0,32938,85600.0,85.0
647,648,Emory &amp; Henry College,Emory,VA,Private,1094,1226,19340.0,27155.0,48100,70700.0,72.0
648,649,Wells College,Aurora,NY,Private,488,516,22828.0,30207.0,55180,NaN,80.0
649,650,Catawba College,Salisbury,NC,Private,1336,1463,19807.0,23662.0,44921,78100.0,42.0

In [29]:
df.dropna(inplace=True)

df

,Rank,Name,City,State,Public/Private,Undergraduate Population,Student Population,Net Price,Average Grant Aid,Total Annual Cost,Alumni Salary,Acceptance Rate
0,1,Harvard University,Cambridge,MA,Private,13844,31120,14327.0,49870.0,69600,146800.0,5.0
1,2,Stanford University,Stanford,CA,Private,8402,17534,13261.0,50134.0,69109,145200.0,5.0
2,3,Yale University,New Haven,CT,Private,6483,12974,18627.0,50897.0,71290,138300.0,7.0
3,4,Massachusetts Institute of Technology,Cambridge,MA,Private,4680,11466,20771.0,43248.0,67430,155200.0,7.0
4,5,Princeton University,Princeton,NJ,Private,5659,8273,9327.0,48088.0,66150,139400.0,6.0
...,...,...,...,...,...,...,...,...,...,...,...,...
644,645,Morehouse College,Atlanta,GA,Private,2202,2219,34928.0,17318.0,48723,98700.0,74.0
645,646,New Mexico State University,Las Cruces,NM,Public,13379,14432,8625.0,9582.0,34720,96700.0,64.0
646,647,Indiana State University,Terre Haute,IN,Public,13626,13763,13012.0,9297.0,32938,85600.0,85.0
647,648,Emory &amp; Henry College,Emory,VA,Private,1094,1226,19340.0,27155.0,48100,70700.0,72.0
649,650,Catawba College,Salisbury,NC,Private,1336,1463,19807.0,23662.0,44921,78100.0,42.0

In [30]:
df.shape

(628, 12)

In [31]:
df.index

Int64Index([  0,   1,   2,   3,   4,   5,   6,   7,   8,   9,
            ...
            639, 640, 641, 642, 643, 644, 645, 646, 647, 649],
           dtype='int64', length=628)

In [32]:
df.reset_index(drop=True,inplace=True)

In [33]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 628 entries, 0 to 627
Data columns (total 12 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   Rank                      628 non-null    int64
 1   Name                      628 non-null    object
 2   City                      628 non-null    object
 3   State                     628 non-null    object
 4   Public/Private            628 non-null    object
 5   Undergraduate Population  628 non-null    int64
 6   Student Population        628 non-null    int64
 7   Net Price                 628 non-null    float64
 8   Average Grant Aid         628 non-null    float64
 9   Total Annual Cost         628 non-null    int64
 10  Alumni Salary             628 non-null    float64
 11  Acceptance Rate           628 non-null    float64
dtypes: float64(4), int64(4), object(4)
memory usage: 59.0+ KB

In [34]:
df.describe().T

,count,mean,std,min,25%,50%,75%,max
Rank,628.0,322.122611,185.360460,1.0,161.75,321.5,479.25,650.0
Undergraduate Population,628.0,10235.472930,11228.048723,323.0,2062.75,4825.5,15867.00,65100.0
Student Population,628.0,12312.912420,13246.660229,406.0,2294.50,6538.5,18357.25,75044.0
Net Price,628.0,22481.570064,8099.771637,1298.0,16476.00,22065.0,27880.75,47270.0
Average Grant Aid,628.0,19971.522293,11214.740998,2975.0,9253.00,19605.0,27431.00,50897.0
Total Annual Cost,628.0,50722.579618,12670.126944,8646.0,40076.00,50478.0,60965.00,75735.0
Alumni Salary,628.0,98616.242038,14026.078146,70700.0,88600.00,96300.0,105400.00,158200.0
Acceptance Rate,628.0,61.721338,21.795857,5.0,49.00,67.0,78.00,100.0